БухЭксп/Catalogs/CW_ШаблоныДоговоров.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>CW_ШаблоныДоговоров</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ДополнительныеХарактеристики</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Параметр</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.CW_ПараметрыГрузоперевозок</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.CW_ПараметрыГрузоперевозок</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ИндексКартинки</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>1</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ОграниченСпискомЗначений</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СоставДаты</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

БухЭксп/Catalogs/CW_ШаблоныДоговоров/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

//Подсистема.ДополнительныеХарактиристикиДоговоров
Функция ПолучитьСписокПараметров(Шаблон) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст ="ВЫБРАТЬ
	              |	CW_ШаблоныДоговоровДополнительныеХарактеристики.Параметр КАК Параметр,
	              |	CW_ШаблоныДоговоровДополнительныеХарактеристики.Значение КАК Значение,
	              |	CW_ШаблоныДоговоровДополнительныеХарактеристики.ИндексКартинки КАК ИндексКартинки,
	              |	CW_ШаблоныДоговоровДополнительныеХарактеристики.ОграниченСпискомЗначений КАК ОграниченСпискомЗначений
	              |ИЗ
	              |	Справочник.CW_ШаблоныДоговоров.ДополнительныеХарактеристики КАК CW_ШаблоныДоговоровДополнительныеХарактеристики
	              |ГДЕ
	              |	CW_ШаблоныДоговоровДополнительныеХарактеристики.Ссылка = &Шаблон";
	
	Запрос.УстановитьПараметр("Шаблон", Шаблон);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Возврат  РезультатЗапроса.Выгрузить();
	
КонецФункции
//Подсистема.ДополнительныеХарактиристикиДоговоров


//Служебные процедуры
Процедура ОбработатьСписокПараметровШаблонов() Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	CW_ШаблоныДоговоров.Ссылка КАК Ссылка
	               |ИЗ
	               |	Справочник.CW_ШаблоныДоговоров КАК CW_ШаблоныДоговоров";
	
	РезультатЗапроса = Запрос.Выполнить();
	Выборка = РезультатЗапроса.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		ШаблонОбъект = Выборка.Ссылка.ПолучитьОбъект();
		
		Для Каждого СтрокаШаблона из  ШаблонОбъект.ДополнительныеХарактеристики Цикл
			Если НЕ ЗначениеЗаполнено(СтрокаШаблона.Параметр) Тогда
				Продолжить;
			КонецЕсли;
			
			CW_ДополнительныеХарактиристикиДоговоровСервер.ОбработатьДанныеСтроки(СтрокаШаблона);
		КонецЦикла;
		
		ШаблонОбъект.Записать();
		
	КонецЦикла;
	
КонецПроцедуры


//Служебные процедуры
#КонецЕсли
